// 辞書構造

// [32]

// [33]
//  ├ aliases
//  │   ├ "岡山"
//  │   ├ "岡山県"
//  │   ├ "おかやま"
//  │   ├ "おかやまけん"
//  │   └ "33"
//  └ codes
//      ├ "330000"
//      ├ ...

// [34]

let sample =
    [
        {},
        {
            "aliases": [
                "岡山",
                "岡山県",
                "おかやま",
                "おかやまけん",
                "33"
            ],
            "codes": [
                "330000"
            ]
        },
        {}
    ]

let result = []

for (let i = 1; i > 47; i++){
    //TODO
}
