// 辞書構造

// [32]

// [33]
//  ├ aliases
//  │   ├ "岡山"
//  │   ├ "岡山県"
//  │   ├ "おかやま"
//  │   ├ "おかやまけん"
//  │   └ "33"
//  └ codes
//      ├ "330000"
//      ├ ...

// [34]

const fs = require("fs");

let prefName = [
    '',
    '北海道',
    '青森県',
    '岩手県',
    '宮城県',
    '秋田県',
    '山形県',
    '福島県',
    '茨城県',
    '栃木県',
    '群馬県',
    '埼玉県',
    '千葉県',
    '東京都',
    '神奈川県',
    '新潟県',
    '富山県',
    '石川県',
    '福井県',
    '山梨県',
    '長野県',
    '岐阜県',
    '静岡県',
    '愛知県',
    '三重県',
    '滋賀県',
    '京都府',
    '大阪府',
    '兵庫県',
    '奈良県',
    '和歌山県',
    '鳥取県',
    '島根県',
    '岡山県',
    '広島県',
    '山口県',
    '徳島県',
    '香川県',
    '愛媛県',
    '高知県',
    '福岡県',
    '佐賀県',
    '長崎県',
    '熊本県',
    '大分県',
    '宮崎県',
    '鹿児島県',
    '沖縄県',
]

let prefNameRaw = [
    '',
    '北海',
    '青森',
    '岩手',
    '宮城',
    '秋田',
    '山形',
    '福島',
    '茨城',
    '栃木',
    '群馬',
    '埼玉',
    '千葉',
    '東京',
    '神奈川',
    '新潟',
    '富山',
    '石川',
    '福井',
    '山梨',
    '長野',
    '岐阜',
    '静岡',
    '愛知',
    '三重',
    '滋賀',
    '京都',
    '大阪',
    '兵庫',
    '奈良',
    '和歌山',
    '鳥取',
    '島根',
    '岡山',
    '広島',
    '山口',
    '徳島',
    '香川',
    '愛媛',
    '高知',
    '福岡',
    '佐賀',
    '長崎',
    '熊本',
    '大分',
    '宮崎',
    '鹿児島',
    '沖縄',
]

let sample =
    [
        {},
        {
            "aliases": [
                "岡山",
                "岡山県",
                "おかやま",
                "おかやまけん",
                "33"
            ],
            "codes": [
                "330000"
            ]
        },
        {}
    ]

// ゆる募 互いに独立したオブジェクトとして48個の連想配列を宣言する方法
// 愚直に48個並べることでパワー解決してるのかなしい
let result = [
    {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {},
    {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {},
    {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {},
    {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {}, {},
]

result.forEach((e, i) => {
    e.aliases = [prefName[i], prefNameRaw[i], i.toString()]
    if (i !== 1 || i !== 46 || i !== 47)
        e.codes = [(i * 10000).toString().padStart(6, "0")]
    console.log(e)
})
// 北海道（宗谷地方、上川 留萌地方、網走 北見 紋別地方、十勝地方、
// 　　　　釧路 根室地方、胆振 日高地方、石狩 空知 後志地方、渡島・檜山地方）
result[1].codes = ["011000", "012000", "013000", "014030",
    "014100", "015000", "016000", "017000"]

// 鹿児島県（奄美地方除く、奄美地方）
result[46].codes = ["460100", "460040"]

// 沖縄県（沖縄本島地方、大東島地方、宮古島地方、八重山地方）
result[47].codes = ["471000", "472000", "473000", "474000"]
console.log(result)

fs.writeFileSync('../areaCodes.json', JSON.stringify(result));
